[{"id":"691e2630-1e14-4d45-98bc-37fc9986fcaf","title":"More Website Updates!","content":"Since the last time we checked in, we had our Musician and Vendors sections added! Today, we've just updated the site and released our Schedule and Map pages! Be sure to check them out! With so many panels and a new venue, getting ahead of the game in terms of planning can make your con experience that much better!\r\n\r\nOur schedule is packed with panels and events, and our venue is brand new and better than ever! We hope you all can manage to put together a plan of attack to maximize the fun at this year's Mare Fair! We're in the final weeks building up to the con, and we can't wait to see you there!\r\n\r\n![](https://fair-filer.marefair.org/2025/news/literallyMareFair-CorpEdition.png)","previewText":"Another Website Update!","heroImage":"https://fair-filer.marefair.org/2025/news/literallyMareFair-CorpEdition.png","slug":"website-update-schedule-and-map","createdBy":"ebonyglow@marefair.org","createdAt":"2025-08-15T20:59:55.797","modifiedDate":"2025-08-15T20:59:55.797","isArchived":false,"isFeatured":true},{"id":"8dc05804-5f4b-46e5-b62f-90d69be77663","title":"A Message From Matinée","content":"Hey everypony! Matinée here! We’ve been getting things set up for Mare Fair 3, and we’re excited to get the show rolling in just under a month now! We figured we’d stop by the Wyndham to reminisce a bit, aaaand because we sorta keep all our files and important papers here. Fair’s been pretty stressed out about the literal pile of paperwork that we’ve been dealing with, but I’ve been sending out some help wanted flyers for the last couple weeks! Y’know, so we could get a helping hoof - er - or hand!\r\n\r\nTurns out we have soooo many applicants! I’m sure whoever the new help may be, be it one of you fandom folks, or another pony, is going to make this whole shebang way smoother! I’ve even got a few applicants already! Like…\r\n\r\n*Hm…*\r\n\r\nAnon, Anon, and…\r\n\r\n*Wait…*\r\n\r\nAnonymous, Anonny, Nonny, Anon, Anon, and Anon…\r\n\r\n*That’s…only the first page…?*\r\n\r\nWowie, that’s a lot of applicants! Guess a lot of ponies and people have that name! Either way, I’m sure one of these applicants is going to be the perfect fit to help us all out! My sister says we’re not that desperate yet, but I can tell she’s worried deep down and is trying to hide it. Thankfully Mimosa has been backing me up and even helped me when it came to sending these out! \r\n\r\nWe’ve told Fair about it a few times, but she’s so wrapped up in putting on the most fantastical, most fun, most snowpity-est event yet! Still, I’m sure she’ll love the interviews when we get them started, after all, I’m sure every last one is going to be super great!\r\n\r\nSee you all at the fair! \r\n\r\nLove, \r\nMatinée <3\r\n\r\n![](https://fair-filer.marefair.org/2025/news/MatineeCM.png)\r\n","previewText":"Heya! Matinée here!","heroImage":"https://fair-filer.marefair.org/2025/news/MatineeCM.png","slug":"matinee-letter","createdBy":"ebonyglow@marefair.org","createdAt":"2025-08-14T21:41:20.85","modifiedDate":"2025-08-14T21:41:20.85","isArchived":false,"isFeatured":false},{"id":"90d92b22-8296-43c3-b4fa-a4955f2b446f","title":"Spaghetti and Tendie Charity Dinner Ticket Sales End Soon!","content":"Is there *ever* a time where you don't crave spaghetti and tendies? Don't answer that, we know you desire them, and thankfully once again we're having our Spaghetti and Tendie Charity Dinner here at Mare Fair 3!\r\n\r\n**But wait**! Ticket sales are coming to a close August 18th, so, if you're wanting to indulge in some fine dining with some fellow lovers of all things mare, you better go and grab your ticket for it before it's too late!\r\n\r\nRemember, you'll be getting a delicious dinner *while*  helping our charities take care of horses in need!\r\n\r\n![](https://fair-filer.marefair.org/2025/news/spaghetti.png)","previewText":"Spaghetti and Tendie Charity Dinner Ticket Sales End Soon!","heroImage":"https://fair-filer.marefair.org/2025/news/spaghetti.png","slug":"charity-dinner-ticket-sales-closing-soon","createdBy":"ebonyglow@marefair.org","createdAt":"2025-08-12T23:22:54.093","modifiedDate":"2025-08-13T02:43:46.593","isArchived":false,"isFeatured":false},{"id":"74251a03-5b97-42f9-923c-1daf89630c24","title":"Matinée and Soirée's Cosplay Contest Sign-Ups are Live!","content":"![The Twins Are Putting On A Show!](https://fair-filer.marefair.org/2025/news/cosplay-contest.jpg)\r\n\r\nGot a mane wig, cardboard armor, or a questionable bodysuit? Good! Matinée and Soirée have been hard at work to present Mare Fair's ever first official cosplay contest! All badge holders are welcome to enter, either solo or in groups. \r\n\r\nCostumes must be pony related, and that includes ponified versions of other characters and OCs (as long as you’ve got a clear reference). Judging will be based on craftsmanship, accuracy, and presentation, but performance is optional.\r\n\r\nYou can sign up now using the form below, or register in person at the convention before the contest begins. Sign-ups will close ten minutes after the event starts. Contestants should also arrive early to line up, and our stagehoof will be there to help. We’ll be awarding a variety of unique prizes across multiple categories, so if you’ve been working on something special, now’s your chance to shine!\r\n\r\nThere are still plans to host a cosplay contest specifically for Anons, so don't fret!\r\n\r\nSign up using the form below:\r\n\r\nhttps://cosplay.marefair.org/","previewText":"Cosplay Contest News!","heroImage":"https://fair-filer.marefair.org/2025/news/cosplay-contest.jpg","slug":"cosplay-contest","createdBy":"ebonyglow@marefair.org","createdAt":"2025-08-06T22:24:28.877","modifiedDate":"2025-08-18T22:46:51.377","isArchived":false,"isFeatured":false},{"id":"7c8cff34-9932-4edc-a567-c67b72508c21","title":"Another Day of Mares! (Mare Fair Animated Advertisement)","content":"With the con just under a month away, we're excited to show off a special animation made to celebrate the build up to Mare Fair 3! Head on over to our Youtube Channel to enjoy a [full-scale animated music video](https://www.youtube.com/watch?v=Z2aZ7K8mADE) just like one of our opening ceremonies productions! And don't fret, there's still going to be a full opening animation at the actual con too!!\r\n\r\n<center>\r\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Z2aZ7K8mADE?si=-2J2nJhKIylHib-z\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\r\n</center>","previewText":"A new ad? A new song? A new...mare?","heroImage":"https://fair-filer.marefair.org/2025/news/another-day-of-mares-site.png","slug":"another-day-of-mares","createdBy":"ebonyglow@marefair.org","createdAt":"2025-08-06T18:22:48.777","modifiedDate":"2025-08-20T20:27:50.447","isArchived":false,"isFeatured":false},{"id":"b99c951d-1a95-4ced-a5bc-113214e62bb8","title":"Cinemare Night: That's Right, It's Bigger","content":"There’s a big update for Cinemare Night!\r\n\r\nAfter coordinating with the movie theater, they managed to figure out a setup that will allow us to use their XL auditorium. What this means is that the whole Screening 1 and Screening 2 nonsense is over. Thank Celestia. We’ll all be together in one big screening! We got this together.\r\n\r\nThe new auditorium will be Theater 12. The time will be the same, September 4 at 10:00 PM. For everyone with an existing Screening 1 or Screening 2 ticket, you'll be able to check in just fine. More details about how to check in and transportation will be available closer to the screening.\r\n\r\n![Mimosa Movie](https://fair-filer.marefair.org/2025/news/cinemare-night-bigger.jpg)","previewText":"There’s a big update for Cinemare Night! We have been upgraded to the XL theater!","heroImage":"https://fair-filer.marefair.org/2025/news/cinemare-night-bigger.jpg","slug":"cinemare-night-bigger","createdBy":"cadbrad@marefair.org","createdAt":"2025-06-29T22:38:13.533","modifiedDate":"2025-06-30T22:53:31.403","isArchived":false,"isFeatured":false},{"id":"e31e5cc7-87a7-40e0-b28e-b0bc0ebc588a","title":"Spaghetti and Tendie Dinner Announcement!","content":"We’re pleased to (finally) announce this year’s Spaghetti and Tendie Dinner!\r\n\r\nThings will be slightly different this time around. We’ve rented out the Café Gauguin, a restaurant conveniently located within the Rosen Centre. The dinner will be from 7:00 PM to 10:00 PM on Friday, September 5th.\r\n\r\nTickets are priced at $40. As a thank you, everyone who comes will receive a commemorative coaster.\r\n\r\nA portion of all proceeds goes to our charities!\r\n\r\nYou can sign up for the event here:\r\n\r\nhttps://tendies.marefair.org\r\n\r\n![Big Mare](https://fair-filer.marefair.org/2025/news/spaghetti-and-tendie-dinner.png)","previewText":"We’re pleased to (finally) announce this year’s Spaghetti and Tendie Dinner!","heroImage":"https://fair-filer.marefair.org/2025/news/spaghetti-and-tendie-dinner.png","slug":"spaghetti-and-tendie-dinner","createdBy":"cadbrad@marefair.org","createdAt":"2025-06-20T22:13:21.193","modifiedDate":"2025-06-20T22:17:08.457","isArchived":false,"isFeatured":false},{"id":"d7c760de-f6e1-467e-b87a-baa645d45a09","title":"Do You Have Your REAL ID?","content":"Today is May 7. That probably doesn't mean much to you. Unless it's your birthday, in which case, happy birthday! For everyone else, today is the day that the TSA will start requiring REAL ID or another acceptable form of identification in order to travel by air. If you are flying to Mare Fair, you should make sure that you have REAL ID! Your old non-REAL ID will no longer be enough.\r\n\r\n**What's REAL ID?**\r\n\r\nA long time ago, Congress passed a bill that standardized identification throughout the US, with security being the primary concern. This was 20 years ago, and they've been kicking the can of enforcement down the road until RIGHT NOW.\r\n\r\n**How do I get REAL ID?**\r\n\r\nCheck out this page for more information:\r\nhttps://www.usa.gov/real-id\r\n\r\n**How do I know if I have REAL ID?**\r\n\r\nCheck your driver's license or ID card. If you have a star in the top right corner, you should be good to go!\r\n\r\n![Morning Mimosa's Driver's License](https://fair-filer.marefair.org/2025/news/real-id-1.png)\r\n\r\nThe star can look like any of these:\r\n\r\n![REAL ID Symbols](https://fair-filer.marefair.org/2025/news/real-id-2.png)\r\n\r\n**Are there any alternatives?**\r\n\r\nYes! If you have a passport, the TSA will accept that too. So, if you're coming to Mare Fair from outside the US, nothing will be different for you.\r\n\r\n![Passport](https://fair-filer.marefair.org/2025/news/real-id-3.png)\r\n\r\nAdditionally, you can use an enhanced driver’s license, an enhanced ID card, or a few more acceptable forms of identification. For a full list, check out this page:\r\nhttps://www.tsa.gov/travel/security-screening/identification\r\n \r\nWe hope you all have a safe journey on your way to Mare Fair. Just make sure your documentation is up to date so you don't have any issues at the airport!\r\n","previewText":"Today is the day that the TSA will start requiring REAL ID or another acceptable form of identification in order to travel by air.","heroImage":"https://fair-filer.marefair.org/2025/news/real-id-1.png","slug":"real-id","createdBy":"cadbrad@marefair.org","createdAt":"2025-05-07T22:13:37.883","modifiedDate":"2025-05-08T02:47:35.663","isArchived":false,"isFeatured":false},{"id":"2d0f8b65-57d2-4c45-8c18-e28c1ac998d1","title":"Charity Dinner Survey","content":"Many of you have been asking about this year’s coveted Spaghetti and Tendie Dinner. We apologize for the delay in updates. Due to increased costs and other factors, we’ve been looking into different options that will make it a fun and affordable event for everyone. We’ve narrowed down the possibilities, and now we need your help deciding!\r\n\r\nWe’d love to know what will work best for most attendees. The choices are:\r\n* Traditional Spaghetti and Tendie Dinner (Estimated ticket cost: $90)\r\n* Pizza and Tendie Dinner (Estimated ticket cost: $75)\r\n* Rent out Café Gauguin (Estimated ticket cost: $38)\r\n\r\nThere are more details in our survey below. If you could fill it out, that would help us greatly!\r\n\r\nhttps://forms.gle/FzhKDV4V9Spn2Vkx7\r\n\r\n![Sautée](https://fair-filer.marefair.org/2025/news/charity-dinner-survey.jpg)","previewText":"We need your help deciding options for our charity dinner!","heroImage":"https://fair-filer.marefair.org/2025/news/charity-dinner-survey.jpg","slug":"charity-dinner-survey","createdBy":"cadbrad@marefair.org","createdAt":"2025-04-26T00:44:20.787","modifiedDate":"2025-04-26T00:47:50.633","isArchived":false,"isFeatured":false},{"id":"aded231e-cba5-47ac-b32f-5bce3f8f1b6e","title":"Cool and New Website Updates!","content":"Do your eyes deceive you? No, we’ve added some new pages to the website! [Now you can grab a drink with our mascots and get to know them!](/mascots) Did you know that Morning Mimosa is from Florida? I didn’t!\r\n\r\nWant to attend the coveted Spaghetti and Tendie Dinner? Well, we’re still working on that. [But you’ll be able to find information about it and our other events by browsing through our brochures!](/events) We’ll make sure to keep them up to date. If you wanted to buy a movie ticket or learn more about the Mare Gallery, you can do so there!\r\n\r\nWould you like to know who’s responsible for our lovely website?[ Check out the “never obsolete” PC we’ve set up!](/credits) We even hooked it up to a Pony Trinitrot TV. Who even uses monitors anymore? Anyway, our team of talented developers and artists has been hard at work making the coolest con website around… and now you’ll be able to see who!\r\n\r\n[You can also read the privacy policy if you’re bored, I guess.](/privacy)\r\n\r\n![Soirée](https://fair-filer.marefair.org/2025/news/cool-and-new-website-updates.jpg)","previewText":"Do your eyes deceive you? No, we’ve added some new pages to the website!","heroImage":"https://fair-filer.marefair.org/2025/news/cool-and-new-website-updates.jpg","slug":"cool-and-new-website-updates","createdBy":"cadbrad@marefair.org","createdAt":"2025-04-15T01:14:53.133","modifiedDate":"2025-04-15T01:15:50.613","isArchived":false,"isFeatured":false},{"id":"25d023bb-6a68-4e29-b75c-0bd7c9631b6f","title":"Introducing Cinemare Night!","content":"Are you ready to see mares *on the big screen*?\r\n\r\n**What is this?**\r\n\r\nSo, we’ll be going out to a movie theater to watch the 2017 My Little Pony: The Movie. Yep, the same thing as last time, but now as an official Mare Fair event! If you didn’t get to come last year, here’s another chance!\r\n\r\n**Where and when is it?**\r\n\r\nWe’ll be having it at the Epic Theatres at Lee Vista, on Thursday, September 4 at 10:00 PM. Like last year we’re going to run two screenings, both at the same time. Just make sure to coordinate with your friends on which screening you’re going to! We’ll be providing transportation to the theater, probably starting around 8 PM. We’ll make sure to update you with the check-in and transportation processes as we get closer to the con.\r\n\r\n**How much is it?**\r\n\r\nIt’s $35 per ticket. Travel expenses are included in the ticket.\r\n\r\n**How do I sign up?**\r\n\r\nhttps://cinemare.marefair.org/\r\n\r\n![Tickets to the MLP Movie!](https://fair-filer.marefair.org/2025/news/introducing-cinemare-night.jpg)","previewText":"Are you ready to see mares on the big screen? Join us for a theatrical screening of 2017's My Little Pony: The Movie!","heroImage":"https://fair-filer.marefair.org/2025/news/introducing-cinemare-night.jpg","slug":"introducing-cinemare-night","createdBy":"cadbrad@marefair.org","createdAt":"2025-02-12T01:10:32.04","modifiedDate":"2025-06-20T22:14:21.603","isArchived":false,"isFeatured":false},{"id":"cbef4ee2-7482-4361-b07d-b41151c550e7","title":"Badge Sales Are Live! ","content":"After a brief delay, [Mare Fair badges](https://marefair.org/register/) will be opening today!\r\n\r\nIf you're looking for any of the limited tiers especially, we suggest you grab what you're looking for as soon as possible. There's no guarantee they won't sell out, so just be wary.\r\n\r\nAlso! Vendor, panelist, musician, and staff [applications](https://marefair.org/apply/) are now open! If you're looking to vend, put on a panel, play some tunes, or help out with the con, be sure to throw in an application! The sooner, the better!\r\n\r\nThe departments that need the most staff and help are Vendor Relations, Operations, and Distribution.\r\n\r\nApply for staff or we will cry. Seriously. So hard. So many tears. It'd truly be insane. A sea of salty sadness. You'll make the mares cry. Apply for staff. I will break your femur if you don't.\r\n\r\n![Look its the register section icon](https://fair-filer.marefair.org/2025/news/badge-updates.webp)","previewText":"Mare Fair Badge Sales Soon! Apply Updates Too! Vendors, Musicians, Panels, and Staff Galore!","heroImage":"https://fair-filer.marefair.org/2025/news/badge-updates.webp","slug":"badge-updates","createdBy":"ebonyglow@marefair.org","createdAt":"2025-02-09T03:23:14.807","modifiedDate":"2025-04-05T10:19:07.93","isArchived":false,"isFeatured":false},{"id":"87017927-e94c-4663-ba40-1a3f568ecd3b","title":"Mare Fair Website Update And More!","content":"We’re here to announce another update to the Mare Fair website! You’ll be able to find sections designated to [Venue](/venue), [Apply](/apply), and [Register](/register)! Be sure to look out for more Easter eggs and hints on the site too!\r\n\r\nSince there’s a new section for the venue, it’s about time we formally announce it! This year’s Mare Fair will be held at the amazing Rosen Centre! The staff at the venue have been incredible to work with, and we’re looking forward to an absolutely great event at their location. \r\n\r\nYou’ll find critical details about the venue in the venue section of the site, so be sure to read it over properly to be as informed as you can!\r\n\r\nRegister is available for viewing, but badge sales aren’t open just yet. We will update you at least 24 hours before badge sales open, so you can be at the ready to grab the one you want \r\n\r\nThere’s still plenty more to add to the site, and even more news to share, in the coming months. Keep an eye out, and you can always ask any questions you may have in our contact us section!","previewText":"New updates for our website are out! Check out sponsor tiers, our apply section, and our grand venue reveal!","heroImage":"https://fair-filer.marefair.org/2025/news/venue-website-update.jpg","slug":"venue-website-update","createdBy":"memely@snowpity.org","createdAt":"2025-01-30T03:07:08.623","modifiedDate":"2025-04-05T10:19:04.07","isArchived":false,"isFeatured":false},{"id":"42509a1a-b4da-49fd-8443-48010950eca4","title":"Mare Fair Website Launch!","content":"And here we have it, our brand new website! A team of artists, developers, and more worked together to put together Mare Fair 2025’s website, but this is just the beginning! Much more will be added over time, but for now we’ve got plenty of important details shared on it!\r\n<br>\r\n<br>\r\nThis years website has a theme, as does the con itself, and if it isn’t obvious yet, just wait till more pops up here! With a battle of the bands on the rise, it seems our mascots and the con itself are sure to put on a show!\r\n<br>\r\n<br>\r\nThis is just the start of this whole shebang, but be sure to check out our entirely new “[News](/news)” section, as well as our [Contact Us](/contact), [About](/about), and [Code of Conduct](/coc)! \r\n<br>\r\n<br>\r\nAgain, more will be added soon as more news comes! For now, we hope you enjoy the site, and be sure to poke around a bit, there’s plenty of little secrets to discover!\r\n<br>\r\n<br>\r\n![Mare Fair 2025](https://fair-filer.marefair.org/2025/news/website-launch.webp)","previewText":"We’re here to celebrate the launch of Mare Fair 2025’s website! There’s lots to share, and plenty more to come!","heroImage":"https://fair-filer.marefair.org/2025/news/website-launch.webp","slug":"website-launch","createdBy":"memely@snowpity.org","createdAt":"2025-01-15T19:21:50.927","modifiedDate":"2025-04-05T10:19:00.323","isArchived":false,"isFeatured":false}]